<?php
namespace common\classes\rst;
class Option
{
    public $cities = [
//        "vin"=>'Винница',"vol"=>'Волынь',"dnp"=>'Днепропетровск',"don"=>'Донецк',"zht"=>'Житомир',
//        "zak"=>'Закарпатье',"zap"=>'Запорожье',"if"=>'Ивано-Франовск',"ko"=>'Киев',"kir"=>'Кировоград',
//        "cri"=>'Крым',"lug"=>'Луганск',"lv"=>'Львов',"nik"=>'Николаев',"od"=>'Одесса',"pol"=>'Полтава',
//        "rov"=>'Ровно',"sum"=>'Суммы',"ter"=>'Тернополь', "kha"=>'Харьков',"khe"=>'Херсон',
//        "khm"=>'Хмельницк',"chk"=>'Черкассы',"chn"=>'Чернигов',"chv"=>'Черновцы',

        'Винница'=>"vin",'Волынь'=>"vol",'Днепропетровск'=>"dnp",'Донецк'=>"don",
        'Житомир'=>"zht",'Закарпатье'=>"zak",'Запорожье'=>"zap",'Ивано-Франовск'=>"if",
        'Киев'=>"ko",'Кировоград'=>"kir",'Крым'=>"cri",'Луганск'=>"lug",'Львов'=>"lv",
        'Николаев'=>"nik",'Одесса'=>"od",'Полтава'=>"pol",'Ровно'=>"rov",'Суммы'=>"sum",
        'Тернополь'=>"ter",'Харьков'=>"kha",'Херсон'=>"khe",'Хмельницк'=>"khm",'Черкассы'=>"chk",
        'Чернигов'=>"chn",'Черновцы'=>"chv"
    ];

    public $transmission = [
                "Ручная / Механика",
                "Автомат",
                "Типтроник",
                "Адаптивная",
                "Вариатор"
    ];

    public $fuel = [
                "Бензин",
                "Дизель",
                "Газ",
                "Газ/бензин",
                "Гибрид",
                "Электро",
                "Другое",
                "Газ метан",
                "Газ пропан-бутан"
    ];

    public    $year = [
                "2016","2015", "2014", "2013", "2012", "2011", "2010", "2009", "2008", "2007", "2006",
                "2005", "2004", "2003", "2002", "2001", "2000", "1999", "1998", "1997", "1996",
                "1995", "1994", "1993", "1992", "1991", "1990", "1989", "1988", "1987", "1986",
                "1985", "1984", "1983", "1982", "1981", "1980", "1979", "1978", "1977", "1976",
                "1975", "1974", "1973", "1972", "1971", "1970", "1969", "1968", "1967", "1966",
                "1965", "1964", "1963", "1962", "1961", "1960", "1959", "1958", "1957", "1956",
                "1955", "1954", "1953", "1952", "1951", "1950", "1949", "1948", "1947", "1946",
                "1945", "1944", "1943", "1942", "1941", "1940", "1939", "1938", "1937", "1936",
                "1935", "1934", "1933", "1932", "1931", "1930", "1929", "1928", "1927", "1926",
                "1925", "1924", "1923", "1922", "1921", "1920", "1919", "1918", "1917", "1916",
                "1915", "1914", "1913", "1912", "1911", "1910"
    ];

    public $model = [
        'Alfa Romeo','Audi','BMW','Chery','Chevrolet','Chrysler','Citroen','Dacia','Daewoo',
        'Daf','Daihatsu','Dodge','Fiat','Ford','Geely','Great Wall','Honda','Hyundai','Infiniti',
        'Iveco','JCB','Jeep','Kia','Lancia','Land Rover','Lexus','Mazda','Mercedes','MINI',
        'Mitsubishi','Nissan','Opel','Peugeot','Porsche','Renault','Saab','Seat','Skoda','Smart',
        'SsangYong','Subaru','Suzuki','TATA','Tesla','Toyota','Volkswagen','Volvo','АЗЛК','Богдан',
        'ВАЗ','ГАЗ','ЗАЗ','ЗИЛ','ИЖ','ЛуАЗ','Москвич','РАФ','УАЗ'
    ];

    public static function getCity($region=null){
        $city = new self;
        return array_search($region, $city->cities);
    }
}